In [7]:
import pandas as pd

In [17]:
fruits = pd.Series(["Apple","Pear","Orange","Melon","Kiwi"], index = [5,6,7,8,9])
fruits

5     Apple
6      Pear
7    Orange
8     Melon
9      Kiwi
dtype: object

In [10]:
fruits.apply(str.upper)

0     APPLE
1      PEAR
2    ORANGE
3     MELON
4      KIWI
dtype: object

In [9]:
numbers = pd.Series([5,6,3])

numbers *2

0    10
1    12
2     6
dtype: int64

In [20]:
numbers >= 5

0     True
1     True
2    False
dtype: bool

In [21]:
numbers[numbers >=5]

0    5
1    6
dtype: int64

In [19]:
fruits[[True,True,False,False,True]]

5    Apple
6     Pear
9     Kiwi
dtype: object

In [24]:
data ={
    "name": ["Anders","Tomas","Mario"],
    "age": [42,46,36]
}

pd.DataFrame(data)

     name  age
0  Anders   42
1   Tomas   46
2   Mario   36

In [32]:
Data = [
    {"name": "anders","age": 42},
    {"name": "Tomas","age": 46},
    {"name": "Mario","age": 36}

]
df = pd.DataFrame(data)
df

     name  age
0  Anders   42
1   Tomas   46
2   Mario   36

In [55]:
df["age"] = df ["age"] + 1
df

     name  age  Age
0  Anders   51   43
1   Tomas   55   47
2   Mario   45   37

In [57]:
df[df["age"] >=50]

     name  age  Age
0  Anders   51   43
1   Tomas   55   47

In [53]:
str(df)

'     name  age  Age\n0  Anders   50   43\n1   Tomas   54   47\n2   Mario   44   37'

In [54]:
print(df)

     name  age  Age
0  Anders   50   43
1   Tomas   54   47
2   Mario   44   37